eisup_2019_docmng_integration/src/BusinessProcesses/абсСогласованиеНоменклатуры/абсСогласованиеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>абсСогласованиеНоменклатуры</name>
  <task>Task.абсЗадачаДоговора</task>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнициаторБП</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

eisup_2019_docmng_integration/src/InformationRegisters/РолиИИсполнители/РолиИИсполнители.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиИИсполнители</name>
  <resources>
    <name>абс_ИндексИсполнителя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыНоменклатуры/абс_СтатусыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыНоменклатуры</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеНСИ</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Использование</name>
  </enumValues>
  <enumValues>
    <name>ДопСогласование</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/BusinessProcesses/абсСогласованиеНоменклатуры/ObjectModule.bsl
Процедура УсловиеУтвержденНДСПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = Номенклатура.абс_СтатусНоменклатуры = Перечисления.абс_СтатусыНоменклатуры.Использование;
	
КонецПроцедуры

Процедура ОткрытьНоменклатуру()
	
	ФормаНоменклатуры = Номенклатура.ПолучитьФорму("ФормаЭлемента");
	
	Если ФормаНоменклатуры.Открыта() Тогда
		ФормаНоменклатуры.Активизировать();
	Иначе
		ФормаНоменклатуры.Открыть();
	КонецЕсли;
	
КонецПроцедуры

// ПРОЦЕДУРЫ ОБРАБОТЧКИ ПриИнтеррактивнойАктивизации

Процедура ДействиеУтверждениеГруппойНСИОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьНоменклатуру();
	
КонецПроцедуры

Процедура ДействиеНоменклатураУтвержденаОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОткрытьНоменклатуру();
	
КонецПроцедуры

Процедура ДействиеОтказаноВСогласованииОбработкаИнтерактивнойАктивации(ТочкаМаршрутаБизнесПроцесса, Задача, СтандартнаяОбработка)
		
	СтандартнаяОбработка = Ложь;
	
	ОткрытьНоменклатуру();
	
КонецПроцедуры

Процедура ДействиеНоменклатураУтвержденаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	ФормируемыеЗадачи.Очистить();
	
	НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
	
	НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
	НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
	НоваяЗадача.Дата 				= ТекущаяДата();

	//НоваяЗадача.Наименование 		= ТочкаМаршрута.НаименованиеЗадачи + ", " + Строка(ЭтотОбъект.Ссылка.Контрагент);
	//
	НоваяЗадача.Наименование = СокрЛП(Номенклатура.Наименование) + " "  
		+ ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
	
	НоваяЗадача.Исполнитель			= ПользовательИнициаторБП;
	
	НоваяЗадача.ОбъектЗадачи 		= Номенклатура;
	
	НоваяЗадача.Записать();
	
	ФормируемыеЗадачи.Добавить(НоваяЗадача);	
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, Номенклатура, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	

КонецПроцедуры

Процедура ДействиеОтказаноВСогласованииПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
			
	ФормируемыеЗадачи.Очистить();
	
	НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
	
	НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
	НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
	НоваяЗадача.Дата 				= ТекущаяДата();

	//НоваяЗадача.Наименование 		= ТочкаМаршрута.НаименованиеЗадачи + ", " + Строка(ЭтотОбъект.Ссылка.Контрагент);
	//
	НоваяЗадача.Наименование = СокрЛП(Номенклатура.Наименование) + " "  
		+ ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
	
	НоваяЗадача.Исполнитель			= ПользовательИнициаторБП;
	
	НоваяЗадача.ОбъектЗадачи 		= Номенклатура;
	
	НоваяЗадача.Записать();
	
	ФормируемыеЗадачи.Добавить(НоваяЗадача);
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, Номенклатура, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	

КонецПроцедуры

Процедура СформироватьГрупповуюЗадачу(ТочкаМаршрута, ФормируемыеЗадачи, Отказ,РольИсполнителей)
	
	//АБС Изменение 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
	ФормируемыеЗадачи.Очистить();
	
	ЗапросИсполнителей = Новый Запрос("ВЫБРАТЬ
	                                  |	РолиИИсполнители.Исполнитель
	                                  |ИЗ
	                                  |	РегистрСведений.РолиИИсполнители КАК РолиИИсполнители
	                                  |ГДЕ
	                                  |	РолиИИсполнители.Роль = &РольИсполнителей");
									  
	//РольИсполнителей = Неопределено;									  
	//Если ТочкаМаршрута = БизнесПроцессы.абсСогласованиеНоменклатуры.ТочкиМаршрута.ДействиеУтверждениеГруппойНСИ Тогда
	//	РольИсполнителей = Справочники.РолиИсполнителей.СотрудникГруппыНСИ;
	//КонецЕсли;
	//
	//Если РольИсполнителей = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	
	ЗапросИсполнителей.УстановитьПараметр("РольИсполнителей", РольИсполнителей);
	
	ВыборкаИсполнителей = ЗапросИсполнителей.Выполнить().Выбрать();
	
	Если ВыборкаИсполнителей.Количество() > 0 Тогда
		НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
		
		НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
		НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрута;
		НоваяЗадача.Дата 				= ТекущаяДата();
	
		//НоваяЗадача.Наименование 		= ТочкаМаршрута.НаименованиеЗадачи + ", " + Строка(ЭтотОбъект.Ссылка.Контрагент);
		//
		НоваяЗадача.Наименование = СокрЛП(Номенклатура.Наименование) + " "  
			+ ТочкаМаршрута.НаименованиеЗадачи + ".";
		
		//НоваяЗадача.Исполнитель			= ВыборкаИсполнителей.Исполнитель;
		
		НоваяЗадача.ОбъектЗадачи 		= Номенклатура;
		
		НоваяЗадача.Записать();
		
		ФормируемыеЗадачи.Добавить(НоваяЗадача);
		
	Иначе
		ttk_ОбщегоНазначения.СообщитьОбОшибке("Не найдено ответственных.", Отказ);
	КонецЕсли;
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, Номенклатура, ТочкаМаршрута, ФормируемыеЗадачи);
	
КонецПроцедуры

Процедура ДействиеУтверждениеГруппойНСИПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) Экспорт
	
	СформироватьГрупповуюЗадачу(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ,Справочники.РолиИсполнителей.СотрудникГруппыНСИ);
	
КонецПроцедуры

//АБС Изменение 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
Процедура СоздатьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи)
	ФормируемыеЗадачи.Очистить();
	
	НоваяЗадача = Задачи.абсЗадачаДоговора.СоздатьЗадачу();
	
	НоваяЗадача.БизнесПроцесс 		= ЭтотОбъект.Ссылка;
	НоваяЗадача.ТочкаМаршрута 		= ТочкаМаршрутаБизнесПроцесса;
	НоваяЗадача.Дата 				= ТекущаяДата();

	НоваяЗадача.Наименование = СокрЛП(Номенклатура.Наименование) + " "  
		+ ТочкаМаршрутаБизнесПроцесса.НаименованиеЗадачи + ".";
	
	НоваяЗадача.Исполнитель			= ПользовательИнициаторБП;
	
	НоваяЗадача.ОбъектЗадачи 		= Номенклатура;
	
	НоваяЗадача.Записать();
	
	ФормируемыеЗадачи.Добавить(НоваяЗадача);	
	
	// Добавим задачи для суперпользователей
	абс_БизнесПроцессы.ДобавитьЗадачиСуперПользователя(ЭтотОбъект.Ссылка, Номенклатура, ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	

КонецПроцедуры
	
Процедура ПовторнаяПодготовкаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СоздатьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
КонецПроцедуры

Процедура ОтказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	СоздатьЗадачуИнициатору(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи);	
КонецПроцедуры
//АБС Изменение 36495  20.02.2014 11:20:34  Родин  Оптимизация бизнес-процессов
